app/views/bills/show.html.erb

  <tbody>
    <% @bill.bill_lines.each do |line| %>
---
SELECT "bill_lines".* FROM "bill_lines" WHERE "bill_lines"."bill_id" = 1