app/controllers/bill_lines_controller.rb

SELECT "bills".* FROM "bills" WHERE "bills"."id" = 1 LIMIT 1
SELECT "products".* FROM "products"
---
  def new
    @bill = Bill.find(params[:bill_id])
    @bill_line = @bill.bill_lines.new
    @products = Product.all

SELECT "bills".* FROM "bills" WHERE "bills"."id" = 1 LIMIT 1
INSERT INTO "bill_lines" ("bill_id", "product_id", "cant", "total", "created_at", "updated_at", "subtotal") VALUES (1, 2, 3, NULL, '2025-07-01 08:27:14.593274', '2025-07-01 08:27:14.593274', 15000.0) RETURNING "id"
---
  def create
    @bill = Bill.find(params[:bill_id])
    @bill_line = @bill.bill_lines.new(bill_line_params)
    if @bill_line.save