app/controllers/bills_controller.rb

  def index
    @bills = Bill.all
---
SELECT "bills".* FROM "bills"

  def show
    @bill = Bill.find(params[:id])
---
SELECT "bills".* FROM "bills" WHERE "bills"."id" = 1 LIMIT 1

  def new
    @bill = Bill.new
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @bill = Bill.new(bill_params)
    if @bill.save
---
INSERT INTO "bills" ("client_id", "date", "subtotal", "total", "created_at", "updated_at") VALUES (1, '2025-06-29 00:00:00', NULL, NULL, '2025-07-01 08:03:18.335708', '2025-07-01 08:03:18.335708') RETURNING "id"

  def destroy
    @bill = Bill.find(params[:id])
    @bill.destroy
---
SELECT "bills".* FROM "bills" WHERE "bills"."id" = 2 LIMIT 1
DELETE FROM "bills" WHERE "bills"."id" = 2