app/controllers/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def show
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1 LIMIT 1

  def create
    @client = Client.new(client_params)
    if @client.save
---
INSERT INTO "clients" ("name", "created_at", "updated_at") VALUES ('Jesus Rojas', '2025-07-01 07:28:09.248431', '2025-07-01 07:28:09.248431') RETURNING "id"