app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "description", "stock", "created_at", "updated_at") VALUES ('Camiseta Dragon Ball M', 5000.0, 'Camiseta de dragon ball negra de hombre talla M', 20, '2025-06-30 23:34:05.843800', '2025-06-30 23:34:05.843800') RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 2 LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 2
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
UPDATE "products" SET "name" = 'Camiseta anime', "price" = 5500.0, "stock" = 15, "updated_at" = '2025-07-01 03:57:26.164971' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)