app/controllers/tax_products_controller.rb

  def new
    @tax_product = TaxProduct.new
    @products = Product.all
    @taxes = Tax.all
---
SELECT "products".* FROM "products"
SELECT "taxes".* FROM "taxes"

  def create
    @tax_product = TaxProduct.new(tax_product_params)
    if @tax_product.save
---
INSERT INTO "tax_products" ("product_id", "tax_id", "created_at", "updated_at") VALUES (2, 1, '2025-07-01 06:26:29.904834', '2025-07-01 06:26:29.904834') RETURNING "id"