app/controllers/taxes_controller.rb

SELECT "taxes".* FROM "taxes"
---
  def index
    @taxes = Tax.all

INSERT INTO "taxes" ("name", "value", "created_at", "updated_at") VALUES ('I.V.A', NULL, '2025-07-01 05:24:43.195051', '2025-07-01 05:24:43.195051') RETURNING "id"
---
  def create
    @tax = Tax.new(tax_params)
    if @tax.save

SELECT "taxes".* FROM "taxes" WHERE "taxes"."id" = 1 LIMIT 1
---
  def edit
    @tax = Tax.find(params[:id])

SELECT "taxes".* FROM "taxes" WHERE "taxes"."id" = 1 LIMIT 1
UPDATE "taxes" SET "value" = 13.0, "updated_at" = '2025-07-01 05:47:45.146915' WHERE "taxes"."id" = 1
---
  def update
    @tax = Tax.find(params[:id])
    if @tax.update(tax_params)

SELECT "taxes".* FROM "taxes" WHERE "taxes"."id" = 3 LIMIT 1
---
  def show
    @tax = Tax.find(params[:id])